#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
random_password.master: Refreshing state... [id=none]
tls_private_key.jumpbox: Refreshing state... [id=f85594efcde6a52be7e1535fe75e0ecd0596cf80]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-09ae4c9f7722b0ff8]
aws_security_group_rule.database_sg_from_jumpbox_sg: Refreshing state... [id=sgrule-4113702315]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1909623485]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-20240111144058395400000001]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-056eb17c17ad555ff]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
aws_security_group_rule.db_egress_all: Refreshing state... [id=sgrule-442621240]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group.jumpbox_sg will be destroyed
  # (because aws_security_group.jumpbox_sg is not in configuration)
  - resource "aws_security_group" "jumpbox_sg" {
      - arn                    = "arn:aws:ec2:us-west-2:446872271111:security-group/sg-09ae4c9f7722b0ff8" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09ae4c9f7722b0ff8" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "jumpbox-sg" -> null
      - owner_id               = "446872271111" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Project"     = "levio-aws-demo-fev"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-0a28d56b4354e1555" -> null
    }

  # aws_security_group_rule.database_sg_from_jumpbox_sg will be destroyed
  # (because aws_security_group_rule.database_sg_from_jumpbox_sg is not in configuration)
  - resource "aws_security_group_rule" "database_sg_from_jumpbox_sg" {
      - from_port                = 0 -> null
      - id                       = "sgrule-4113702315" -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-07425be98e514225f" -> null
      - security_group_rule_id   = "sgr-046d0b5518e86eca6" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-09ae4c9f7722b0ff8" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # tls_private_key.jumpbox will be destroyed
  # (because tls_private_key.jumpbox is not in configuration)
  - resource "tls_private_key" "jumpbox" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "f85594efcde6a52be7e1535fe75e0ecd0596cf80" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "91:7e:b0:9f:1f:d0:42:65:88:81:e4:0c:2b:f1:f6:f6" -> null
      - public_key_fingerprint_sha256 = "SHA256:hrxaxgXzMwEcbi/rGX6PFhPIl53UUpWkwGKRgL0Ityg" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDiKUAQx+x6XEj9XEwBKsUhErnTtfr07Hu2dMUgH5h1X7+FBuR8lwwhspaMoliBIU3oAIm7NUJd+DKzUtQs0ZXNaqln5RJWAz6WhJdzHosWvklrpdJwzgvKhPLbiUVxNorYZCW+MYbz+HC9ovRv0ywiCdBYmRwGXIc4gZWJryzrani3RHM4JMZL6cqBD3qVIyfx24OKPVvHorYWM//ouVsiV/yiP8r7QoQJge3FnzL12w0eOwMkZtVL7jE6vY1CYn8g8zueQsWaa0GRN1S+ai6A66lLfodiJY5IuNZ/UNu5CC8Gd8xxkRclsc/oSHRBDY4Fv37UFxr1960l3OMkskft/P3kppixSjxCAiUqjNvUVcW7tuhVIwdq6JJQ/hXVvQZg/ZDolwhvQFtrcKezUKOcwkhw2dKjbDNNODbSEeCgBAZU3P52SRYGdqEpiZYvi5HP9TFq2fsT1ke9hqzXhtem8AFJXS0rxIbWzbsUAG8p8j4WU0vD1XhnpY1qiZH2N2gsuQQVcnk3XxMQ4pLdtKG922yr6WXcSEVfkrgMwl0iOL7s6Z5E4bMUN1lAKrwr0235G0CJOLmEjjiJvWWyal6m0BrP/YI1M7UXQi4Dih19sutyP7X4yoBZWxYCUewpuAQmQwiLBqbK26X9ZEsvLaTV36YS+EWmckuXwVcKL5ngsw==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA4ilAEMfselxI/VxMASrF
            IRK507X69Ox7tnTFIB+YdV+/hQbkfJcMIbKWjKJYgSFN6ACJuzVCXfgys1LULNGV
            zWqpZ+USVgM+loSXcx6LFr5Ja6XScM4LyoTy24lFcTaK2GQlvjGG8/hwvaL0b9Ms
            IgnQWJkcBlyHOIGVia8s62p4t0RzOCTGS+nKgQ96lSMn8duDij1bx6K2FjP/6Llb
            Ilf8oj/K+0KECYHtxZ8y9dsNHjsDJGbVS+4xOr2NQmJ/IPM7nkLFmmtBkTdUvmou
            gOupS36HYiWOSLjWf1DbuQgvBnfMcZEXJbHP6Eh0QQ2OBb9+1Bca9fetJdzjJLJH
            7fz95KaYsUo8QgIlKozb1FXFu7boVSMHauiSUP4V1b0GYP2Q6JcIb0Bba3Cns1Cj
            nMJIcNnSo2wzTTg20hHgoAQGVNz+dkkWBnahKYmWL4uRz/Uxatn7E9ZHvYas14bX
            pvABSV0tK8SG1s27FABvKfI+FlNLw9V4Z6WNaomR9jdoLLkEFXJ5N18TEOKS3bSh
            vdtsq+ll3EhFX5K4DMJdIji+7OmeROGzFDdZQCq8K9Nt+RtAiTi5hI44ib1lsmpe
            ptAaz/2CNTO1F0IuA4odfbLrcj+1+MqAWVsWAlHsKbgEJkMIiwamytul/WRLLy2k
            1d+mEvhFpnJLl8FXCi+Z4LMCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-ingestion"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/ingestion-lambda-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::446872271111:role/levio-demo-fev-ingestion"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PGVECTOR_COLLECTION_NAME"      = "emails-embeddings"
              + "PGVECTOR_DATABASE"             = "vector_db"
              + "PGVECTOR_DRIVER"               = "psycopg2"
              + "PGVECTOR_HOST"                 = "vector-db.cyxgx8pmxirg.us-west-2.rds.amazonaws.com"
              + "PGVECTOR_PASSWORD_SECRET_NAME" = "arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond"
              + "PGVECTOR_PORT"                 = "5432"
              + "PGVECTOR_USER"                 = "postgres_admin"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-034fb73568e35a2ad",
            ]
          + subnet_ids                  = [
              + "subnet-0bbf6497c54be8733",
              + "subnet-0cea1fda906409973",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Planning and apply infrastructure`*